#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.TL_DecalEmissive__FinishedFunc
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_TL_DecalEmissive__FinishedFunc_Params
	{	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.TL_DecalEmissive__UpdateFunc
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_TL_DecalEmissive__UpdateFunc_Params
	{	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.TL_MeshDissolve__FinishedFunc
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_TL_MeshDissolve__FinishedFunc_Params
	{	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.TL_MeshDissolve__UpdateFunc
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_TL_MeshDissolve__UpdateFunc_Params
	{	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.ReceiveBeginPlay
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_03_K2Node_ComponentBoundEvent_1_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_03_K2Node_ComponentBoundEvent_1_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_02_K2Node_ComponentBoundEvent_2_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_02_K2Node_ComponentBoundEvent_2_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_01_K2Node_ComponentBoundEvent_3_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_01_K2Node_ComponentBoundEvent_3_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_04_K2Node_ComponentBoundEvent_4_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_04_K2Node_ComponentBoundEvent_4_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_05_K2Node_ComponentBoundEvent_5_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_05_K2Node_ComponentBoundEvent_5_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.BndEvt__SM_Weevil02_Gib_06_K2Node_ComponentBoundEvent_6_ComponentSleepSignature__DelegateSignature
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_BndEvt__SM_Weevil02_Gib_06_K2Node_ComponentBoundEvent_6_ComponentSleepSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_InfectedHazeAmbientExplosion.BP_InfectedHazeAmbientExplosion_C.ExecuteUbergraph_BP_InfectedHazeAmbientExplosion
	 */
	struct ABP_InfectedHazeAmbientExplosion_C_ExecuteUbergraph_BP_InfectedHazeAmbientExplosion_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
