#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.CheckLootConditionals
	 */
	struct ABP_Weevil_Evil_C_CheckLootConditionals_Params
	{
	public:
		struct FDataTableRowHandle                                 ItemDataRowHandle;                                       // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.ShowHuskMesh
	 */
	struct ABP_Weevil_Evil_C_ShowHuskMesh_Params
	{	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.UserConstructionScript
	 */
	struct ABP_Weevil_Evil_C_UserConstructionScript_Params
	{	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.BndEvt__AttackHandlerComponent_K2Node_ComponentBoundEvent_0_HandleAttackEffectsDelegate__DelegateSignature
	 */
	struct ABP_Weevil_Evil_C_BndEvt__AttackHandlerComponent_K2Node_ComponentBoundEvent_0_HandleAttackEffectsDelegate__DelegateSignature_Params
	{
	public:
		struct FDataTableRowHandle                                 AttackDataRowHandle;                                     // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.ReceiveBeginPlay
	 */
	struct ABP_Weevil_Evil_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.StartChargeUp
	 */
	struct ABP_Weevil_Evil_C_StartChargeUp_Params
	{	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_1_OnHandleEffectsEvent__DelegateSignature
	 */
	struct ABP_Weevil_Evil_C_BndEvt__HealthComponent_K2Node_ComponentBoundEvent_1_OnHandleEffectsEvent__DelegateSignature_Params
	{
	public:
		struct FVector                                             HitLocation;                                             // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Weevil_Evil.BP_Weevil_Evil_C.ExecuteUbergraph_BP_Weevil_Evil
	 */
	struct ABP_Weevil_Evil_C_ExecuteUbergraph_BP_Weevil_Evil_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_0IRD[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
