#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct GlobalColorList.GlobalColorList
	 * Size -> 0x0370
	 */
	struct FGlobalColorList
	{
	public:
		struct FLinearColor                                        SCABosBase_87_99E08A38437A85A7846EA1842FA8EE24;          // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SCABosAccentOne_88_3CCA0512412C38E4F32D2E99B88F5217;     // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SCABOSAccentTwo_89_8B01C63240876D377E4C0EB9CB63A33B;     // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SCABOSAccentThree_90_312107B946678C840AD176AB61F13DC1;   // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SCABOSWarningOne_91_FAEA5A634AD3888D68B5B1AD6CADC9EE;    // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ResourceButton_92_303246F340BE6C2F2C874AA22A67CC5C;      // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ResourceButtonSelectedEnabled_93_8666835640E08835B7FCAFA477EF6567; // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ResourceAccent_94_3AB19D2145A42EF31F5F59929D553A90;      // 0x0070(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableButtonEnabled_95_7AC954CF420F84265E49AB8F9CE1909B; // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableButtonSelectedEnabled_96_46B24F634EAD328ED6D95DA3930A884A; // 0x0090(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableButtonSelectedDisabled_97_604AE52244741BAEB85ABCAF19E52075; // 0x00A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableAccentEnabled_98_37BB86524BB05B66BC3F558B512EE70C; // 0x00B0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableButtonDisabled_99_BE4F41F74BFBA2DA093B448D1DD27F1C; // 0x00C0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        CraftableAccentDisabled_100_D04BC9F0498E73A9E853A78F26911919; // 0x00D0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BuildingButtonEnabled_101_A89306294E511B8C96AC2FA296B8A8F0; // 0x00E0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BuildingButtonSelectedEnabled_102_C10580C744E43DE7A01EF6A521668FA6; // 0x00F0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BuildingAccentEnabled_103_5C1AA36A444B932F758BDA9E6F700050; // 0x0100(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BuildingButtonDisabled_104_77568F4B4CA96737E52D00A9FB5C6455; // 0x0110(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BuildingAccentDisabled_105_AB1B730C461DFF976CAD2BBCB1653870; // 0x0120(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BottomButton_106_CF0A32B64995DFE0A3D08FB6473C3756;       // 0x0130(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BottomButtonDisabled_107_A4D0262B487D3362846F84BFC72668F2; // 0x0140(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Selecting_109_189F43FA40A845CA1C507AB7DB16D6AD;          // 0x0150(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Selected_110_34D3AEC3480635500157CFA7C48F02F7;           // 0x0160(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Food_111_594315EC469A45D4977DA1BD1056B4AF;               // 0x0170(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Health_86_4F81EF2B4B10338E222D838F1AAF0572;              // 0x0180(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Water_112_42A69B3341E031F505832DA97C2C48EE;              // 0x0190(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Stamina_113_0EB03C574F7FA2A842A3EF821679F5BC;            // 0x01A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Energy_114_0175E3BA4CC7D2B0D2F77BA20F9EC2FD;             // 0x01B0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        XP_115_0D2805024255DAED45A869BC2C547834;                 // 0x01C0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BasicText_116_6701154442EC1644EC0B47AE383576F8;          // 0x01D0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        HeaderText_117_9373EE824C65BE0F7EF86E9486BD7211;         // 0x01E0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SubheaderText_118_760B5C3048F35745B828B19C0AAC147D;      // 0x01F0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        DisabledText_119_7859802143A6210E3446E3B6DB97EE6A;       // 0x0200(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        GlobalBG_120_8F619B104D4EF72D4E1828945486C23F;           // 0x0210(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        GlobalBGDarkener_121_8D9815D7444A06C36A61A8BE50345E70;   // 0x0220(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        GamepadAttachedBtnBGFadeout_122_E12CA2214DF12A72910F76B87B91EB56; // 0x0230(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ButtonBGAccent_108_57853F7C4686BC108E80D4A6E200D6C3;     // 0x0240(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Attention_123_FDE05925442649CA6587DEAE8F9346EF;          // 0x0250(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        LoseResource_128_0DFB47C74E001523CC86DA8DB0B12859;       // 0x0260(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        GainResource_129_288801794C058B38FCFB83950C0779F4;       // 0x0270(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        TabButtonCheckedText_132_68A2930D44CEB4E1255BAFBA1F03234F; // 0x0280(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        TabButtonUncheckedText_134_99CE675F42886787C6CF89891631619E; // 0x0290(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ButtonUpText_136_71C8F17540823CA44BCB64B6B591DAB4;       // 0x02A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ButtonOverText_138_E3763EFC493818829CAD44B43E846430;     // 0x02B0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        ButtonDisabledText_140_933091684B348F924F65D8B0DD53F66C; // 0x02C0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Durability_142_2DED48E4490660CFC9977F858D0D8FBA;         // 0x02D0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Power_144_DFB3DB274BB134C176002EB3321A271D;              // 0x02E0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        MaterialA_147_E5E4A58A401D1BA5492965BB8A23858F;          // 0x02F0(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        MaterialB_149_AE40BC8C45CE9C1C78867DA824901292;          // 0x0300(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        BottomButtonOver_153_2AD8E33A445E936CEEA4DF9207F2D22E;   // 0x0310(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        SelectedButtonTextOver_155_32C4FA9441D9128AB124E393B521752D; // 0x0320(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        Interact_158_FB1DE29C46A900EF3DA7408226016894;           // 0x0330(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        HighContrastBG_161_3F3F3CF242AC12C766A906957EA02876;     // 0x0340(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        HeatMapPositive_166_BCAB72D046B77B7376CD84908EB23AE7;    // 0x0350(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FLinearColor                                        HeatMapNegative_167_90B1DBD74BFB0A24C8067981068ED85D;    // 0x0360(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
