#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Maine.Ability
	 * Size -> 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
	 */
	class UAbility : public UObject
	{
	public:
		unsigned char                                              UnknownData_QWPC[0x18];                                  // 0x0028(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttack*                                             Attack;                                                  // 0x0040(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FA5Z[0x8];                                   // 0x0048(0x0008) MISSED OFFSET (PADDING)

	public:
		float GetCooldownTimeRemaining();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AchievementsComponent
	 * Size -> 0x0048 (FullSize[0x00F8] - InheritedSize[0x00B0])
	 */
	class UAchievementsComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_V0IV[0x10];                                  // 0x00B0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAchievementStatus>                          Achievements;                                            // 0x00C0(0x0010) Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_30TH[0x20];                                  // 0x00D0(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bShowDebug;                                              // 0x00F0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_C362[0x7];                                   // 0x00F1(0x0007) MISSED OFFSET (PADDING)

	public:
		void ServerRequestAchievementReevaluation();
		void OnTotalPartyPlayerStatChanged(class UPlayerStatConfig* PlayerStat, int32_t Value);
		void OnRep_Achievements();
		void OnPlayerUpgradesChanged(class UPlayerUpgradeComponent* InPlayerUpgradeComponent);
		void OnPlayerStatChanged(class UPlayerStatConfig* PlayerStat, int32_t Value);
		void OnKeyItemObtained(const struct FDataTableRowHandle& ItemRowHandle, class ASurvivalPlayerState* AcquirerPlayerState, TArray<struct FDataTableRowHandle> RecipesLearned);
		void OnGlobalVariableChanged(const struct FGuid& GlobalVariableID, int32_t VariableValue, class AActor* Instigator);
		void ClientUpdateAchievementProgressOnline(const class FString& AchievementUnlockTag, int32_t Progress);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.GameUserWidget
	 * Size -> 0x0008 (FullSize[0x0278] - InheritedSize[0x0270])
	 */
	class UGameUserWidget : public UNarratableUserWidget
	{
	public:
		unsigned char                                              UnknownData_WWX2[0x8];                                   // 0x0270(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnUsingGamepadChangedImpl(bool bIsUsingGamepad);
		void OnUsingGamepadChanged(bool bOnUsingGamepadChanged);
		void OnPossessedPlayerChange(class ASurvivalPlayerCharacter* NewPlayerCharacter);
		void OnOwnerInventoryChanged();
		void OnGlobalColorChangeImpl();
		void OnGlobalColorChange();
		void OnGameInputTypeChangedImpl(EGameInputType NewGameInputType);
		void OnGameInputTypeChanged(EGameInputType NewGameInputType);
		bool HandleKeyEventChord(const struct FInputChord& InChord);
		class ASurvivalPlayerCharacter* GetSurvivalPlayerCharacter();
		class ASurvivalPlayerController* GetOwningSurvivalPlayerController();
		class AGameUI* GetGameUI();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.ActionWidget
	 * Size -> 0x0020 (FullSize[0x0298] - InheritedSize[0x0278])
	 */
	class UActionWidget : public UGameUserWidget
	{
	public:
		class UTextBlock*                                          KeyText;                                                 // 0x0278(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UImage*                                              ButtonImage;                                             // 0x0280(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FName                                                ActionName;                                              // 0x0288(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bAxisPositive;                                           // 0x0290(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bShowMouseKeyboardControls;                              // 0x0291(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bShowGamepadControls;                                    // 0x0292(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_EN8C[0x5];                                   // 0x0293(0x0005) MISSED OFFSET (PADDING)

	public:
		bool ShouldShowControl();
		void SetShowMouseKeyboardControls(bool bValue);
		void SetShowGamepadControls(bool bValue);
		void SetAction(const class FName& InActionName, bool bInAxisPositive);
		void Refresh();
		void NativeOnUsingGamepadChanged(bool bIsUsingGamepad);
		void HandleCultureChanged();
		void HandleAxisMappingChanged(const struct FInputAxisKeyMapping& Value);
		void HandleActionMappingChanged(const struct FInputActionKeyMapping& Value);
		struct FKey GetFirstActionKey();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.ActorPoolComponent
	 * Size -> 0x0018 (FullSize[0x00C8] - InheritedSize[0x00B0])
	 */
	class UActorPoolComponent : public UActorComponent
	{
	public:
		class UClass*                                              BaseObject;                                              // 0x00B0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class AActor*>                                      PooledInstances;                                         // 0x00B8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected

	public:
		void ReleaseInstance(class AActor* Instance);
		class AActor* GetInstance();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AIDataProvider_ClimbingTag
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UAIDataProvider_ClimbingTag : public UAIDataProvider
	{
	public:
		struct FGameplayTag                                        Value;                                                   // 0x0028(0x0008) Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AIDataProvider_FleeRange
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UAIDataProvider_FleeRange : public UAIDataProvider
	{
	public:
		float                                                      Value;                                                   // 0x0028(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K4SX[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AIDataProvider_WanderRange
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UAIDataProvider_WanderRange : public UAIDataProvider
	{
	public:
		float                                                      Value;                                                   // 0x0028(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0HZQ[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AIDetectionComponent
	 * Size -> 0x0048 (FullSize[0x00F8] - InheritedSize[0x00B0])
	 */
	class UAIDetectionComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_6KL6[0x8];                                   // 0x00B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      IntensityThreshold;                                      // 0x00B8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      InvestigateTime;                                         // 0x00BC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_PNU4[0x38];                                  // 0x00C0(0x0038) MISSED OFFSET (PADDING)

	public:
		void OnPerceptionUpdate(class AActor* Actor, const struct FAIStimulus& Stimulus);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AIEQSParameter
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAIEQSParameter : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.Attack_MinAttackDistance
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAttack_MinAttackDistance : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.Attack_MaxAttackDistance
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAttack_MaxAttackDistance : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.Attack_PreferredMaxAttackDistance
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAttack_PreferredMaxAttackDistance : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AI_MinimumHeight
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAI_MinimumHeight : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AI_WanderRange
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAI_WanderRange : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AI_MovementSpeed
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAI_MovementSpeed : public UAIEQSParameter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AI_WaveSpawnRange
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UAI_WaveSpawnRange : public UAIEQSParameter
	{
	public:
		unsigned char                                              UnknownData_G2TF[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AI_WaveSpawnSeparation
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UAI_WaveSpawnSeparation : public UAIEQSParameter
	{
	public:
		unsigned char                                              UnknownData_YDNC[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AISense_Shout
	 * Size -> 0x0068 (FullSize[0x00E8] - InheritedSize[0x0080])
	 */
	class UAISense_Shout : public UAISense
	{
	public:
		TArray<struct FAIShoutEvent>                               ShoutEvents;                                             // 0x0080(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		float                                                      SpeedOfSoundSq;                                          // 0x0090(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_710Q[0x54];                                  // 0x0094(0x0054) MISSED OFFSET (PADDING)

	public:
		void ReportShoutEvent(class UObject* WorldContextObject, class AActor* Shouter, class AActor* Target, const class FName& Tag);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AISense_Sound
	 * Size -> 0x0060 (FullSize[0x00E0] - InheritedSize[0x0080])
	 */
	class UAISense_Sound : public UAISense
	{
	public:
		TArray<struct FAISoundEvent>                               SoundEvents;                                             // 0x0080(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7DJ7[0x50];                                  // 0x0090(0x0050) MISSED OFFSET (PADDING)

	public:
		void ReportSoundEvent(class UObject* WorldContextObject, class AActor* Instigator, const struct FVector& Location, float Intensity, float Range, const class FName& Tag);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AISenseConfig_Shout
	 * Size -> 0x0010 (FullSize[0x0058] - InheritedSize[0x0048])
	 */
	class UAISenseConfig_Shout : public UAISenseConfig
	{
	public:
		class UClass*                                              Implementation;                                          // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ShoutHearingRadius;                                      // 0x0050(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6PBT[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AISenseConfig_Sound
	 * Size -> 0x0010 (FullSize[0x0058] - InheritedSize[0x0048])
	 */
	class UAISenseConfig_Sound : public UAISenseConfig
	{
	public:
		class UClass*                                              Implementation;                                          // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HearingRadius;                                           // 0x0050(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8SQC[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AITargettingComponent
	 * Size -> 0x00C0 (FullSize[0x0170] - InheritedSize[0x00B0])
	 */
	class UAITargettingComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_5TPE[0x8];                                   // 0x00B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SuspiciousThreshold;                                     // 0x00B8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      DangerThreshold;                                         // 0x00BC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      TargetExpirationTime;                                    // 0x00C0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ThreatDecayTime;                                         // 0x00C4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      DamageThreatModifier;                                    // 0x00C8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      HearingThreatModifier;                                   // 0x00CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      TargetDistanceModifier;                                  // 0x00D0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EBuildingTargettingType                                    BuildingTargetType;                                      // 0x00D4(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ETargetPriorityType                                        TargetPriorityType;                                      // 0x00D5(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bTargetsCanExpire;                                       // 0x00D6(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       UseRandomTarget;                                         // 0x00D7(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      RandomTargetModeSelectInterval;                          // 0x00D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ProbabilitySelectedRandomModeTarget;                     // 0x00DC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TWeakObjectPtr<class AActor>                               CachedRandomTargetKey;                                   // 0x00E0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VR56[0x88];                                  // 0x00E8(0x0088) MISSED OFFSET (PADDING)

	public:
		void ValidateTargets();
		void OnPerceptionUpdate(class AActor* Actor, const struct FAIStimulus& Stimulus);
		class AActor* GetTargetActor();
		void CacheRandomOverrideTarget();
		void CacheCurrentTarget();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AITokenManager
	 * Size -> 0x0058 (FullSize[0x0080] - InheritedSize[0x0028])
	 */
	class UAITokenManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_5DQU[0x58];                                  // 0x0028(0x0058) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.HourBasedOneShotsData
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UHourBasedOneShotsData : public UDataAsset
	{
	public:
		TArray<struct FHourBasedOneShotBundle>                     HourlyEntries;                                           // 0x0030(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AmbienceManager
	 * Size -> 0x0040 (FullSize[0x0068] - InheritedSize[0x0028])
	 */
	class UAmbienceManager : public UObject
	{
	public:
		class FScriptMulticastDelegate                             OnUpdateZoneAmbienceDelegate;                            // 0x0028(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class UQuadAudioBedComponent*                              QuadAudioBedComponent;                                   // 0x0038(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class UAmbienceZoneBucket*>                         ZoneBuckets;                                             // 0x0040(0x0010) Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected
		struct FDataTableRowHandle                                 LocalZoneAudioDataRowHandle;                             // 0x0050(0x0010) Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_OG8Z[0x8];                                   // 0x0060(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnUpdateZone(const struct FDataTableRowHandle& PrevZoneDataTableRowHandle, const struct FDataTableRowHandle& NewZoneDataTableRowHandle, bool bIsSubmerged);
		void OnHourChanged(int32_t NewHour, int32_t NewDay);
		void HandleEnterNewZone(const struct FDataTableRowHandle& ZoneAudioRowHandle);
		struct FDataTableRowHandle GetLocalZoneAudioDataRowHandle();
		void DestroyAllZoneBuckets();
		void CreateNewZoneBuckets(class UDataTable* OneShotDataTable);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AmbienceZoneBucket
	 * Size -> 0x01E8 (FullSize[0x0210] - InheritedSize[0x0028])
	 */
	class UAmbienceZoneBucket : public UObject
	{
	public:
		class FName                                                ZoneOneShotEntryName;                                    // 0x0028(0x0008) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FZoneOneShotEntry                                   ZoneOneShotEntry;                                        // 0x0030(0x01D8) Edit, EditConst, Protected, NativeAccessSpecifierProtected
		struct FTimerHandle                                        CurrentTimerHandle;                                      // 0x0208(0x0008) Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void TryPlayOSAndStartTimer();
		bool TryPlayingOneShot(int32_t StartHourOfDay, int32_t EndHourOfDay, float Probability);
		void StartTimer();
		bool IsHourWithingRange(int32_t HourToCheck);
		void Init(const class FName& InZoneOneShotEntryName, const struct FZoneOneShotEntry& InZoneOneShotEntry);
		void Cleanup();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimationInteractComponent
	 * Size -> 0x0028 (FullSize[0x00D8] - InheritedSize[0x00B0])
	 */
	class UAnimationInteractComponent : public UActorComponent
	{
	public:
		class FScriptMulticastDelegate                             OnInteractAnimation;                                     // 0x00B0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class UAnimEffect*                                         Anim;                                                    // 0x00C0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              Prop;                                                    // 0x00C8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_LL4W[0x8];                                   // 0x00D0(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.BaseAnimEffect
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UBaseAnimEffect : public UDataAsset
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimEffect
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimEffect : public UBaseAnimEffect
	{
	public:
		class UAnimMontage*                                        Anim;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_ConsumeFrame
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ConsumeFrame : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_DropItem
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_DropItem : public UAnimNotify
	{
	public:
		EEquipmentSlot                                             DropSlot;                                                // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZYWQ[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_Footstep
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_Footstep : public UAnimNotify
	{
	public:
		EFootstepType                                              OverrideFootstepType;                                    // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R0SI[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_HitFrame
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_HitFrame : public UAnimNotify
	{
	public:
		bool                                                       UseSecondaryDamageData;                                  // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B8KV[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    SecondaryDamageDataIndex;                                // 0x003C(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_InteractFrame
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_InteractFrame : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_InteractShakeDown
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_InteractShakeDown : public UAnimNotify
	{
	public:
		class UCurveFloat*                                         WiggleAmplitude;                                         // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_LadderHandPlant
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_LadderHandPlant : public UAnimNotify
	{
	public:
		unsigned char                                              bIsRightHand : 1;                                        // 0x0038(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6A5Z[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_LightFire
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_LightFire : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_PlayBiteEffect
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_PlayBiteEffect : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_PlayCharacterSound
	 * Size -> 0x0028 (FullSize[0x0060] - InheritedSize[0x0038])
	 */
	class UAnimNotify_PlayCharacterSound : public UAnimNotify
	{
	public:
		ECharacterAudioType                                        SoundType;                                               // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AS7D[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        SoundTag;                                                // 0x003C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VolumeMultiplier;                                        // 0x0044(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchMultiplier;                                         // 0x0048(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bFollow : 1;                                             // 0x004C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YCPY[0x3];                                   // 0x004D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                AttachName;                                              // 0x0050(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                UnderwaterParam;                                         // 0x0058(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_SetMovementMode
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_SetMovementMode : public UAnimNotify
	{
	public:
		EMovementMode                                              Mode;                                                    // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZOLY[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotify_ThrowItem
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ThrowItem : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_AttackRootMotion
	 * Size -> 0x00C8 (FullSize[0x00F8] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_AttackRootMotion : public UAnimNotifyState
	{
	public:
		float                                                      MaxScale;                                                // 0x0030(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DT6M[0xC4];                                  // 0x0034(0x00C4) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_DisableGravity
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_DisableGravity : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_ForceCameraMode
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_ForceCameraMode : public UAnimNotifyState
	{
	public:
		ECameraDisplayMode                                         ForcedMode;                                              // 0x0030(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E14E[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BlendTime;                                               // 0x0034(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_HideSlot
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_HideSlot : public UAnimNotifyState
	{
	public:
		EEquipmentSlot                                             ItemSlot;                                                // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_M85W[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    StanceOverride;                                          // 0x0034(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_HitActive
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_HitActive : public UAnimNotifyState
	{
	public:
		class FName                                                AttackTag;                                               // 0x0030(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bOnehitFromAllCollision;                                 // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LV1X[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_IgnoreFlinch
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_IgnoreFlinch : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_IgnoreStagger
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_IgnoreStagger : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_LerpToGround
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_LerpToGround : public UAnimNotifyState
	{
	public:
		unsigned char                                              UnknownData_X7YC[0x20];                                  // 0x0030(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_LerpToInteract
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_LerpToInteract : public UAnimNotifyState
	{
	public:
		unsigned char                                              UnknownData_M9X1[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_LockSplineRotation
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_LockSplineRotation : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_MultiHitFrame
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_MultiHitFrame : public UAnimNotifyState
	{
	public:
		EHitFrameType                                              HitFrameType;                                            // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_T1FV[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttack*                                             ActualAttack;                                            // 0x0038(0x0008) BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       UseSecondaryDamageData;                                  // 0x0040(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_HV6B[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    SecondaryDamageDataIndex;                                // 0x0044(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_SetFlying
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_SetFlying : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AnimNotifyState_ShowProp
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_ShowProp : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.BaseAppearanceData
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UBaseAppearanceData : public UDataAsset
	{
	public:
		class USkeletalMesh* GetDefaultMesh();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AppearanceData
	 * Size -> 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
	 */
	class UAppearanceData : public UBaseAppearanceData
	{
	public:
		unsigned char                                              DefaultMesh[0x28];                                       // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              FemaleMesh[0x28];                                        // 0x0058(0x0028) UNKNOWN PROPERTY: SoftObjectProperty

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.HairAppearanceData
	 * Size -> 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
	 */
	class UHairAppearanceData : public UBaseAppearanceData
	{
	public:
		struct FSkeletalMeshAttachment                             DefaultMesh;                                             // 0x0030(0x0010) Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected
		TMap<struct FGameplayTag, struct FSkeletalMeshAttachment>  HairMeshes;                                              // 0x0040(0x0050) Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.SpawnedItem
	 * Size -> 0x01F0 (FullSize[0x0420] - InheritedSize[0x0230])
	 */
	class ASpawnedItem : public AActor
	{
	public:
		unsigned char                                              UnknownData_UK3S[0x118];                                 // 0x0230(0x0118) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDataTableRowHandle                                 PlacedItemData;                                          // 0x0348(0x0010) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSpawnedItemInteract;                                   // 0x0358(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSpawnedItemDestroyed;                                  // 0x0368(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		float                                                      OverrideGameHourLifetime;                                // 0x0378(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bUseOverrideGameHourLifetime : 1;                        // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLifetimeDespawnWhenProxiedOnly : 1;                     // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WOGW[0x3];                                   // 0x037D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        GoapRegionTag;                                           // 0x0380(0x0008) Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObsidianIDComponent*                                ObsidianIDComponent;                                     // 0x0388(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UItem*                                               Item;                                                    // 0x0390(0x0008) Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class ASurvivalCharacter*                                  EquippedOwner;                                           // 0x0398(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class AActor*                                              AttackOwner;                                             // 0x03A0(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TWeakObjectPtr<class UBaseLODActor>                        DroppedByActor;                                          // 0x03A8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VO9S[0xD];                                   // 0x03B0(0x000D) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              bIsThrown : 1;                                           // 0x03BD(0x0001) BIT_FIELD BlueprintVisible, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bHasImpacted : 1;                                        // 0x03BD(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bCanAiInteract : 1;                                      // 0x03BD(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              CanLODItem : 1;                                          // 0x03BD(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bInteractOnTouch : 1;                                    // 0x03BD(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ESpawnedItemEmbedType                                      EmbedOnHit;                                              // 0x03BE(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_O8H8[0x1];                                   // 0x03BF(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FFloatRange                                         EmbedRotationOnHit;                                      // 0x03C0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MinimumEmbedNormal;                                      // 0x03D0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bRotateOnEmbed : 1;                                      // 0x03D4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bThrowStraight : 1;                                      // 0x03D4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bIsTickingAttack : 1;                                    // 0x03D4(0x0001) BIT_FIELD Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bThrowAttackCleared : 1;                                 // 0x03D4(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bIsAttached : 1;                                         // 0x03D4(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_TS2V[0xB];                                   // 0x03D5(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             PreviousVelocity;                                        // 0x03E0(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ZiplineMaxSpeedMultiplier;                               // 0x03EC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USoundCue*                                           PhysicsImpactAudio;                                      // 0x03F0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ImpactEffectDelay;                                       // 0x03F8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_H2NE[0x4];                                   // 0x03FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinImpactThreshold;                                      // 0x0400(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MaxImpactThreshold;                                      // 0x0404(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MinImpactVolume;                                         // 0x0408(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MaxImpactVolume;                                         // 0x040C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_4Z1D[0x8];                                   // 0x0410(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AZiplineLine*                                        AttachedZipline;                                         // 0x0418(0x0008) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		bool ValidateItemData(TArray<class FText>* ValidationErrors);
		void TickZipline(float DeltaTime);
		void TickThrown(float DeltaTime);
		void TickBuoyancy(float DeltaTime);
		void TickAttached(float DeltaTime);
		void Throw(class APawn* Thrower, const struct FVector& Impulse, const struct FVector& AngularImpulse);
		void StartThrownAttack(class AActor* Thrower);
		void SetEquippedOwner(class ASurvivalCharacter* NewOwner);
		void ServerUseItem(class AActor* InstigatedBy);
		void ServerUseAndDestroyItem(class AActor* InstigatedBy);
		void ServerPickupItem(class AActor* InstigatedBy);
		void ServerHaulItem(class AActor* InstigatedBy);
		void ServerEquipAndDestroyItem(class AActor* InstigatedBy);
		int32_t RemoveItem(class UItem* InItem, int32_t Count);
		void OnThrown();
		void OnSelectedAmmoChanged(const class FName& SelectedAmmoType);
		void OnRep_IsAttached();
		void OnRep_AttachedZipline();
		void OnPhysicsWake(class UPrimitiveComponent* SleepingComponent, const class FName& BoneName);
		void OnPhysicsSleep(class UPrimitiveComponent* SleepingComponent, const class FName& BoneName);
		void OnLaunchAttack(class UAttack* Attack);
		void OnItemUnequipped(class ASurvivalCharacter* Character, EEquipmentSlot Slot);
		void OnItemEquipped(class ASurvivalCharacter* Character, EEquipmentSlot Slot);
		void OnHitWithAttack(const struct FDamageInfo& DamageInfo);
		void NotifySwapped(bool bFromDamage);
		void NotifySpawned();
		void K2_Initialize();
		bool IsThrownAttackTimerActive();
		bool IsHaulingItem();
		bool IsEmbeddableMaterial(class UPhysicalMaterial* Material);
		void HandleTouch(class AActor* Actor);
		void HandlePhysicsVolumeChanged(class APhysicsVolume* Volume);
		bool GetThrowStraight();
		class USoundCue* GetPickupAudio();
		TArray<class UItem*> GetItems();
		class UItem* GetItem();
		class ASurvivalCharacter* GetEquippedOwner();
		class USoundCue* GetEquipAudio();
		class ASurvivalCharacter* GetDroppedBySpawnedActor();
		class UBaseLODActor* GetDroppedBy();
		float GetDistanceFromThrownLocation();
		class USoundCue* GetConsumeAudio();
		class AActor* GetAttackOwner();
		void DoDetach();
		void DelayedDestroy();
		void ClearThrownAttackTimer();
		bool CanUse(class AActor* InstigatedBy);
		bool CanEquipTo(class AActor* Actor);
		bool CanEquip();
		bool CanAddItems(TArray<class UItem*> InItems);
		bool CanAddItemRowHandles(TArray<struct FDataTableRowHandle> ItemRowHandles);
		bool CanAddItemRowHandle(const struct FDataTableRowHandle& ItemRowHandle);
		bool CanAddItem(class UItem* InItem);
		TArray<class UGoapAction*> AllocateGOAPActions(class USurvivalGameInstance* GameInstance, class UObject* InOwner);
		void AddItem(class UItem* InItem, bool bIsNewItem);
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.ArmorItem
	 * Size -> 0x0020 (FullSize[0x0440] - InheritedSize[0x0420])
	 */
	class AArmorItem : public ASpawnedItem
	{
	public:
		class UBaseAppearanceData*                                 HeadAppearance;                                          // 0x0420(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBaseAppearanceData*                                 ChestAppearance;                                         // 0x0428(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBaseAppearanceData*                                 ArmsAppearance;                                          // 0x0430(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBaseAppearanceData*                                 LegsAppearance;                                          // 0x0438(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.AttachmentPoint
	 * Size -> 0x0010 (FullSize[0x0240] - InheritedSize[0x0230])
	 */
	class AAttachmentPoint : public AActor
	{
	public:
		bool                                                       bIsInUse;                                                // 0x0230(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NYV5[0x7];                                   // 0x0231(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UArrowComponent*                                     Arrow;                                                   // 0x0238(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetInUse(bool Value);
		bool GetInUse();
		class UArrowComponent* GetArrow();
		static UClass* StaticClass();
	};

	/**
	 * Class Maine.Attack
	 * Size -> 0x0168 (FullSize[0x0190] - InheritedSize[0x0028])
	 */
	class UAttack : public UObject
	{
	public:
		unsigned char                                              UnknownData_W3JQ[0x40];                                  // 0x0028(0x0040) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAttackDataPreloadAssets                            InCombatPreloader;                                       // 0x0068(0x0060) Transient, NativeAccessSpecifierPrivate
		struct FAttackDataPreloadAssets                            AttackActivePreloader;                                   // 0x00C8(0x0060) Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UVXB[0x68];                                  // 0x0128(0x0068) MISSED OFFSET (PADDING)

	public:
		void SpawnProjectile(const struct FTransform& SpawnTransform);
		bool ShouldLockRotation();
		bool ShouldEndOnHit();
		void ResolveAttackForHitResult(const struct FHitResult& HitResult);
		EAttackResolutionType ResolveAttack(bool UseSecondaryDamageData, int32_t SecondaryDamageDataIndex);
		bool RequiresFacing();
		bool IsSummonAttack();
		bool IsSelfDestruct();
		bool IsSelfAttack();
		bool IsRangedAttack();
		bool IsLoopingAttack();
		bool IsHostile();
		bool IsHazardAttack();
		bool IsCharged();
		bool IsAOE();
		bool HasToSummonBossMobPhase();
		class UAnimMontage* GetWeaponAnimMontage();
		int32_t GetTier();
		int32_t GetStaminaCost();
		float GetSoundRange();
