#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Maine.Ability.GetCooldownTimeRemaining
	 */
	struct UAbility_GetCooldownTimeRemaining_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.ServerRequestAchievementReevaluation
	 */
	struct UAchievementsComponent_ServerRequestAchievementReevaluation_Params
	{	};

	/**
	 * Function Maine.AchievementsComponent.OnTotalPartyPlayerStatChanged
	 */
	struct UAchievementsComponent_OnTotalPartyPlayerStatChanged_Params
	{
	public:
		class UPlayerStatConfig*                                   PlayerStat;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Value;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.OnRep_Achievements
	 */
	struct UAchievementsComponent_OnRep_Achievements_Params
	{	};

	/**
	 * Function Maine.AchievementsComponent.OnPlayerUpgradesChanged
	 */
	struct UAchievementsComponent_OnPlayerUpgradesChanged_Params
	{
	public:
		class UPlayerUpgradeComponent*                             InPlayerUpgradeComponent;                                // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.OnPlayerStatChanged
	 */
	struct UAchievementsComponent_OnPlayerStatChanged_Params
	{
	public:
		class UPlayerStatConfig*                                   PlayerStat;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Value;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.OnKeyItemObtained
	 */
	struct UAchievementsComponent_OnKeyItemObtained_Params
	{
	public:
		struct FDataTableRowHandle                                 ItemRowHandle;                                           // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		class ASurvivalPlayerState*                                AcquirerPlayerState;                                     // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FDataTableRowHandle>                         RecipesLearned;                                          // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.OnGlobalVariableChanged
	 */
	struct UAchievementsComponent_OnGlobalVariableChanged_Params
	{
	public:
		struct FGuid                                               GlobalVariableID;                                        // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    VariableValue;                                           // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KWWF[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Instigator;                                              // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AchievementsComponent.ClientUpdateAchievementProgressOnline
	 */
	struct UAchievementsComponent_ClientUpdateAchievementProgressOnline_Params
	{
	public:
		class FString                                              AchievementUnlockTag;                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Progress;                                                // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.OnUsingGamepadChangedImpl
	 */
	struct UGameUserWidget_OnUsingGamepadChangedImpl_Params
	{
	public:
		bool                                                       bIsUsingGamepad;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.OnUsingGamepadChanged
	 */
	struct UGameUserWidget_OnUsingGamepadChanged_Params
	{
	public:
		bool                                                       bOnUsingGamepadChanged;                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.OnPossessedPlayerChange
	 */
	struct UGameUserWidget_OnPossessedPlayerChange_Params
	{
	public:
		class ASurvivalPlayerCharacter*                            NewPlayerCharacter;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.OnOwnerInventoryChanged
	 */
	struct UGameUserWidget_OnOwnerInventoryChanged_Params
	{	};

	/**
	 * Function Maine.GameUserWidget.OnGlobalColorChangeImpl
	 */
	struct UGameUserWidget_OnGlobalColorChangeImpl_Params
	{	};

	/**
	 * Function Maine.GameUserWidget.OnGlobalColorChange
	 */
	struct UGameUserWidget_OnGlobalColorChange_Params
	{	};

	/**
	 * Function Maine.GameUserWidget.OnGameInputTypeChangedImpl
	 */
	struct UGameUserWidget_OnGameInputTypeChangedImpl_Params
	{
	public:
		EGameInputType                                             NewGameInputType;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.OnGameInputTypeChanged
	 */
	struct UGameUserWidget_OnGameInputTypeChanged_Params
	{
	public:
		EGameInputType                                             NewGameInputType;                                        // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.HandleKeyEventChord
	 */
	struct UGameUserWidget_HandleKeyEventChord_Params
	{
	public:
		struct FInputChord                                         InChord;                                                 // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.GetSurvivalPlayerCharacter
	 */
	struct UGameUserWidget_GetSurvivalPlayerCharacter_Params
	{
	public:
		class ASurvivalPlayerCharacter*                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.GetOwningSurvivalPlayerController
	 */
	struct UGameUserWidget_GetOwningSurvivalPlayerController_Params
	{
	public:
		class ASurvivalPlayerController*                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.GameUserWidget.GetGameUI
	 */
	struct UGameUserWidget_GetGameUI_Params
	{
	public:
		class AGameUI*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.ShouldShowControl
	 */
	struct UActionWidget_ShouldShowControl_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.SetShowMouseKeyboardControls
	 */
	struct UActionWidget_SetShowMouseKeyboardControls_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.SetShowGamepadControls
	 */
	struct UActionWidget_SetShowGamepadControls_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.SetAction
	 */
	struct UActionWidget_SetAction_Params
	{
	public:
		class FName                                                InActionName;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bInAxisPositive;                                         // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.Refresh
	 */
	struct UActionWidget_Refresh_Params
	{	};

	/**
	 * Function Maine.ActionWidget.NativeOnUsingGamepadChanged
	 */
	struct UActionWidget_NativeOnUsingGamepadChanged_Params
	{
	public:
		bool                                                       bIsUsingGamepad;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.HandleCultureChanged
	 */
	struct UActionWidget_HandleCultureChanged_Params
	{	};

	/**
	 * Function Maine.ActionWidget.HandleAxisMappingChanged
	 */
	struct UActionWidget_HandleAxisMappingChanged_Params
	{
	public:
		struct FInputAxisKeyMapping                                Value;                                                   // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.HandleActionMappingChanged
	 */
	struct UActionWidget_HandleActionMappingChanged_Params
	{
	public:
		struct FInputActionKeyMapping                              Value;                                                   // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActionWidget.GetFirstActionKey
	 */
	struct UActionWidget_GetFirstActionKey_Params
	{
	public:
		struct FKey                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActorPoolComponent.ReleaseInstance
	 */
	struct UActorPoolComponent_ReleaseInstance_Params
	{
	public:
		class AActor*                                              Instance;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.ActorPoolComponent.GetInstance
	 */
	struct UActorPoolComponent_GetInstance_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AIDetectionComponent.OnPerceptionUpdate
	 */
	struct UAIDetectionComponent_OnPerceptionUpdate_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAIStimulus                                         Stimulus;                                                // 0x0008(0x003C)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AISense_Shout.ReportShoutEvent
	 */
	struct UAISense_Shout_ReportShoutEvent_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Shouter;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Target;                                                  // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                Tag;                                                     // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AISense_Sound.ReportSoundEvent
	 */
	struct UAISense_Sound_ReportSoundEvent_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Instigator;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Location;                                                // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Intensity;                                               // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Range;                                                   // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                Tag;                                                     // 0x0024(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AITargettingComponent.ValidateTargets
	 */
	struct UAITargettingComponent_ValidateTargets_Params
	{	};

	/**
	 * Function Maine.AITargettingComponent.OnPerceptionUpdate
	 */
	struct UAITargettingComponent_OnPerceptionUpdate_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FAIStimulus                                         Stimulus;                                                // 0x0008(0x003C)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AITargettingComponent.GetTargetActor
	 */
	struct UAITargettingComponent_GetTargetActor_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AITargettingComponent.CacheRandomOverrideTarget
	 */
	struct UAITargettingComponent_CacheRandomOverrideTarget_Params
	{	};

	/**
	 * Function Maine.AITargettingComponent.CacheCurrentTarget
	 */
	struct UAITargettingComponent_CacheCurrentTarget_Params
	{	};

	/**
	 * Function Maine.AmbienceManager.OnUpdateZone
	 */
	struct UAmbienceManager_OnUpdateZone_Params
	{
	public:
		struct FDataTableRowHandle                                 PrevZoneDataTableRowHandle;                              // 0x0000(0x0010)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
		struct FDataTableRowHandle                                 NewZoneDataTableRowHandle;                               // 0x0010(0x0010)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bIsSubmerged;                                            // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceManager.OnHourChanged
	 */
	struct UAmbienceManager_OnHourChanged_Params
	{
	public:
		int32_t                                                    NewHour;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    NewDay;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceManager.HandleEnterNewZone
	 */
	struct UAmbienceManager_HandleEnterNewZone_Params
	{
	public:
		struct FDataTableRowHandle                                 ZoneAudioRowHandle;                                      // 0x0000(0x0010)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceManager.GetLocalZoneAudioDataRowHandle
	 */
	struct UAmbienceManager_GetLocalZoneAudioDataRowHandle_Params
	{
	public:
		struct FDataTableRowHandle                                 ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceManager.DestroyAllZoneBuckets
	 */
	struct UAmbienceManager_DestroyAllZoneBuckets_Params
	{	};

	/**
	 * Function Maine.AmbienceManager.CreateNewZoneBuckets
	 */
	struct UAmbienceManager_CreateNewZoneBuckets_Params
	{
	public:
		class UDataTable*                                          OneShotDataTable;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceZoneBucket.TryPlayOSAndStartTimer
	 */
	struct UAmbienceZoneBucket_TryPlayOSAndStartTimer_Params
	{	};

	/**
	 * Function Maine.AmbienceZoneBucket.TryPlayingOneShot
	 */
	struct UAmbienceZoneBucket_TryPlayingOneShot_Params
	{
	public:
		int32_t                                                    StartHourOfDay;                                          // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    EndHourOfDay;                                            // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Probability;                                             // 0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceZoneBucket.StartTimer
	 */
	struct UAmbienceZoneBucket_StartTimer_Params
	{	};

	/**
	 * Function Maine.AmbienceZoneBucket.IsHourWithingRange
	 */
	struct UAmbienceZoneBucket_IsHourWithingRange_Params
	{
	public:
		int32_t                                                    HourToCheck;                                             // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceZoneBucket.Init
	 */
	struct UAmbienceZoneBucket_Init_Params
	{
	public:
		class FName                                                InZoneOneShotEntryName;                                  // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FZoneOneShotEntry                                   InZoneOneShotEntry;                                      // 0x0008(0x01D8)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AmbienceZoneBucket.Cleanup
	 */
	struct UAmbienceZoneBucket_Cleanup_Params
	{	};

	/**
	 * Function Maine.BaseAppearanceData.GetDefaultMesh
	 */
	struct UBaseAppearanceData_GetDefaultMesh_Params
	{
	public:
		class USkeletalMesh*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ValidateItemData
	 */
	struct ASpawnedItem_ValidateItemData_Params
	{
	public:
		TArray<class FText>                                        ValidationErrors;                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.TickZipline
	 */
	struct ASpawnedItem_TickZipline_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.TickThrown
	 */
	struct ASpawnedItem_TickThrown_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.TickBuoyancy
	 */
	struct ASpawnedItem_TickBuoyancy_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.TickAttached
	 */
	struct ASpawnedItem_TickAttached_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.Throw
	 */
	struct ASpawnedItem_Throw_Params
	{
	public:
		class APawn*                                               Thrower;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Impulse;                                                 // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             AngularImpulse;                                          // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.StartThrownAttack
	 */
	struct ASpawnedItem_StartThrownAttack_Params
	{
	public:
		class AActor*                                              Thrower;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.SetEquippedOwner
	 */
	struct ASpawnedItem_SetEquippedOwner_Params
	{
	public:
		class ASurvivalCharacter*                                  NewOwner;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ServerUseItem
	 */
	struct ASpawnedItem_ServerUseItem_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ServerUseAndDestroyItem
	 */
	struct ASpawnedItem_ServerUseAndDestroyItem_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ServerPickupItem
	 */
	struct ASpawnedItem_ServerPickupItem_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ServerHaulItem
	 */
	struct ASpawnedItem_ServerHaulItem_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.ServerEquipAndDestroyItem
	 */
	struct ASpawnedItem_ServerEquipAndDestroyItem_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.RemoveItem
	 */
	struct ASpawnedItem_RemoveItem_Params
	{
	public:
		class UItem*                                               InItem;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Count;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnThrown
	 */
	struct ASpawnedItem_OnThrown_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.OnSelectedAmmoChanged
	 */
	struct ASpawnedItem_OnSelectedAmmoChanged_Params
	{
	public:
		class FName                                                SelectedAmmoType;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnRep_IsAttached
	 */
	struct ASpawnedItem_OnRep_IsAttached_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.OnRep_AttachedZipline
	 */
	struct ASpawnedItem_OnRep_AttachedZipline_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.OnPhysicsWake
	 */
	struct ASpawnedItem_OnPhysicsWake_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnPhysicsSleep
	 */
	struct ASpawnedItem_OnPhysicsSleep_Params
	{
	public:
		class UPrimitiveComponent*                                 SleepingComponent;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnLaunchAttack
	 */
	struct ASpawnedItem_OnLaunchAttack_Params
	{
	public:
		class UAttack*                                             Attack;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnItemUnequipped
	 */
	struct ASpawnedItem_OnItemUnequipped_Params
	{
	public:
		class ASurvivalCharacter*                                  Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EEquipmentSlot                                             Slot;                                                    // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnItemEquipped
	 */
	struct ASpawnedItem_OnItemEquipped_Params
	{
	public:
		class ASurvivalCharacter*                                  Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EEquipmentSlot                                             Slot;                                                    // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.OnHitWithAttack
	 */
	struct ASpawnedItem_OnHitWithAttack_Params
	{
	public:
		struct FDamageInfo                                         DamageInfo;                                              // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.NotifySwapped
	 */
	struct ASpawnedItem_NotifySwapped_Params
	{
	public:
		bool                                                       bFromDamage;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.NotifySpawned
	 */
	struct ASpawnedItem_NotifySpawned_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.K2_Initialize
	 */
	struct ASpawnedItem_K2_Initialize_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.IsThrownAttackTimerActive
	 */
	struct ASpawnedItem_IsThrownAttackTimerActive_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.IsHaulingItem
	 */
	struct ASpawnedItem_IsHaulingItem_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.IsEmbeddableMaterial
	 */
	struct ASpawnedItem_IsEmbeddableMaterial_Params
	{
	public:
		class UPhysicalMaterial*                                   Material;                                                // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.HandleTouch
	 */
	struct ASpawnedItem_HandleTouch_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.HandlePhysicsVolumeChanged
	 */
	struct ASpawnedItem_HandlePhysicsVolumeChanged_Params
	{
	public:
		class APhysicsVolume*                                      Volume;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetThrowStraight
	 */
	struct ASpawnedItem_GetThrowStraight_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetPickupAudio
	 */
	struct ASpawnedItem_GetPickupAudio_Params
	{
	public:
		class USoundCue*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetItems
	 */
	struct ASpawnedItem_GetItems_Params
	{
	public:
		TArray<class UItem*>                                       ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetItem
	 */
	struct ASpawnedItem_GetItem_Params
	{
	public:
		class UItem*                                               ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetEquippedOwner
	 */
	struct ASpawnedItem_GetEquippedOwner_Params
	{
	public:
		class ASurvivalCharacter*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetEquipAudio
	 */
	struct ASpawnedItem_GetEquipAudio_Params
	{
	public:
		class USoundCue*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetDroppedBySpawnedActor
	 */
	struct ASpawnedItem_GetDroppedBySpawnedActor_Params
	{
	public:
		class ASurvivalCharacter*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetDroppedBy
	 */
	struct ASpawnedItem_GetDroppedBy_Params
	{
	public:
		class UBaseLODActor*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetDistanceFromThrownLocation
	 */
	struct ASpawnedItem_GetDistanceFromThrownLocation_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetConsumeAudio
	 */
	struct ASpawnedItem_GetConsumeAudio_Params
	{
	public:
		class USoundCue*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.GetAttackOwner
	 */
	struct ASpawnedItem_GetAttackOwner_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.DoDetach
	 */
	struct ASpawnedItem_DoDetach_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.DelayedDestroy
	 */
	struct ASpawnedItem_DelayedDestroy_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.ClearThrownAttackTimer
	 */
	struct ASpawnedItem_ClearThrownAttackTimer_Params
	{	};

	/**
	 * Function Maine.SpawnedItem.CanUse
	 */
	struct ASpawnedItem_CanUse_Params
	{
	public:
		class AActor*                                              InstigatedBy;                                            // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanEquipTo
	 */
	struct ASpawnedItem_CanEquipTo_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanEquip
	 */
	struct ASpawnedItem_CanEquip_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanAddItems
	 */
	struct ASpawnedItem_CanAddItems_Params
	{
	public:
		TArray<class UItem*>                                       InItems;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanAddItemRowHandles
	 */
	struct ASpawnedItem_CanAddItemRowHandles_Params
	{
	public:
		TArray<struct FDataTableRowHandle>                         ItemRowHandles;                                          // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanAddItemRowHandle
	 */
	struct ASpawnedItem_CanAddItemRowHandle_Params
	{
	public:
		struct FDataTableRowHandle                                 ItemRowHandle;                                           // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.CanAddItem
	 */
	struct ASpawnedItem_CanAddItem_Params
	{
	public:
		class UItem*                                               InItem;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.AllocateGOAPActions
	 */
	struct ASpawnedItem_AllocateGOAPActions_Params
	{
	public:
		class USurvivalGameInstance*                               GameInstance;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UObject*                                             InOwner;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class UGoapAction*>                                 ReturnValue;                                             // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.SpawnedItem.AddItem
	 */
	struct ASpawnedItem_AddItem_Params
	{
	public:
		class UItem*                                               InItem;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsNewItem;                                              // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AttachmentPoint.SetInUse
	 */
	struct AAttachmentPoint_SetInUse_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AttachmentPoint.GetInUse
	 */
	struct AAttachmentPoint_GetInUse_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.AttachmentPoint.GetArrow
	 */
	struct AAttachmentPoint_GetArrow_Params
	{
	public:
		class UArrowComponent*                                     ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.SpawnProjectile
	 */
	struct UAttack_SpawnProjectile_Params
	{
	public:
		struct FTransform                                          SpawnTransform;                                          // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.ShouldLockRotation
	 */
	struct UAttack_ShouldLockRotation_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.ShouldEndOnHit
	 */
	struct UAttack_ShouldEndOnHit_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.ResolveAttackForHitResult
	 */
	struct UAttack_ResolveAttackForHitResult_Params
	{
	public:
		struct FHitResult                                          HitResult;                                               // 0x0000(0x008C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.ResolveAttack
	 */
	struct UAttack_ResolveAttack_Params
	{
	public:
		bool                                                       UseSecondaryDamageData;                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_PFWV[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    SecondaryDamageDataIndex;                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EAttackResolutionType                                      ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.RequiresFacing
	 */
	struct UAttack_RequiresFacing_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsSummonAttack
	 */
	struct UAttack_IsSummonAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsSelfDestruct
	 */
	struct UAttack_IsSelfDestruct_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsSelfAttack
	 */
	struct UAttack_IsSelfAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsRangedAttack
	 */
	struct UAttack_IsRangedAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsLoopingAttack
	 */
	struct UAttack_IsLoopingAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsHostile
	 */
	struct UAttack_IsHostile_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsHazardAttack
	 */
	struct UAttack_IsHazardAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsCharged
	 */
	struct UAttack_IsCharged_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.IsAOE
	 */
	struct UAttack_IsAOE_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.HasToSummonBossMobPhase
	 */
	struct UAttack_HasToSummonBossMobPhase_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetWeaponAnimMontage
	 */
	struct UAttack_GetWeaponAnimMontage_Params
	{
	public:
		class UAnimMontage*                                        ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetTier
	 */
	struct UAttack_GetTier_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetStaminaCost
	 */
	struct UAttack_GetStaminaCost_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetSoundRange
	 */
	struct UAttack_GetSoundRange_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetSoundIntensity
	 */
	struct UAttack_GetSoundIntensity_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetPreferredMaxDistance
	 */
	struct UAttack_GetPreferredMaxDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetPreferredHeight
	 */
	struct UAttack_GetPreferredHeight_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetPreferredDistancePostLunge
	 */
	struct UAttack_GetPreferredDistancePostLunge_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetOwner
	 */
	struct UAttack_GetOwner_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetOverrideDeflectAnim
	 */
	struct UAttack_GetOverrideDeflectAnim_Params
	{
	public:
		class UAnimMontage*                                        ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetMinDistance
	 */
	struct UAttack_GetMinDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetMaxDuration
	 */
	struct UAttack_GetMaxDuration_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetMaxDistance
	 */
	struct UAttack_GetMaxDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetItemOwner
	 */
	struct UAttack_GetItemOwner_Params
	{
	public:
		class UItem*                                               ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetInstigator
	 */
	struct UAttack_GetInstigator_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Maine.Attack.GetHitResolutionType
	 */
	struct UAttack_GetHitResolutionType_Params
	{
	public:
		EAttackHitType                                             ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
