#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.GetExplodeColor
	 */
	struct UUI_BlockNugget_C_GetExplodeColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.GetShieldInnerBColor
	 */
	struct UUI_BlockNugget_C_GetShieldInnerBColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.GetShieldInnerAColor
	 */
	struct UUI_BlockNugget_C_GetShieldInnerAColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.GetShieldOuterColor
	 */
	struct UUI_BlockNugget_C_GetShieldOuterColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.BlockAnim
	 */
	struct UUI_BlockNugget_C_BlockAnim_Params
	{	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.BlockSoundPlay
	 */
	struct UUI_BlockNugget_C_BlockSoundPlay_Params
	{	};

	/**
	 * Function UI_BlockNugget.UI_BlockNugget_C.ExecuteUbergraph_UI_BlockNugget
	 */
	struct UUI_BlockNugget_C_ExecuteUbergraph_UI_BlockNugget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
