#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.BndEvt__PageDotButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UUI_RadialPageDot_C_BndEvt__PageDotButton_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.SetActive
	 */
	struct UUI_RadialPageDot_C_SetActive_Params
	{
	public:
		bool                                                       Active;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.Init
	 */
	struct UUI_RadialPageDot_C_Init_Params
	{
	public:
		int32_t                                                    PageNum;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.BndEvt__PageDotButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUI_RadialPageDot_C_BndEvt__PageDotButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.BndEvt__PageDotButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	 */
	struct UUI_RadialPageDot_C_BndEvt__PageDotButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.OnGlobalColorChange
	 */
	struct UUI_RadialPageDot_C_OnGlobalColorChange_Params
	{	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.ExecuteUbergraph_UI_RadialPageDot
	 */
	struct UUI_RadialPageDot_C_ExecuteUbergraph_UI_RadialPageDot_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_1JDO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UI_RadialPageDot.UI_RadialPageDot_C.OnPressed__DelegateSignature
	 */
	struct UUI_RadialPageDot_C_OnPressed__DelegateSignature_Params
	{
	public:
		class UUI_RadialPageDot_C*                                 RadialPageDot;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
