#pragma once

/**
 * Name: Maine
 * Version: Shipping
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetStaminaTooltip
	 */
	struct UUI_VitalsWidget_C_GetStaminaTooltip_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetWaterTooltip
	 */
	struct UUI_VitalsWidget_C_GetWaterTooltip_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.SetHungerTooltip
	 */
	struct UUI_VitalsWidget_C_SetHungerTooltip_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.SetHealthTooltip
	 */
	struct UUI_VitalsWidget_C_SetHealthTooltip_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetPercentageColor
	 */
	struct UUI_VitalsWidget_C_GetPercentageColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetWaterGlobal
	 */
	struct UUI_VitalsWidget_C_GetWaterGlobal_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetFoodGlobal
	 */
	struct UUI_VitalsWidget_C_GetFoodGlobal_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetStaminaGlobal
	 */
	struct UUI_VitalsWidget_C_GetStaminaGlobal_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetEnergyGlobal
	 */
	struct UUI_VitalsWidget_C_GetEnergyGlobal_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.GetHealthGlobal
	 */
	struct UUI_VitalsWidget_C_GetHealthGlobal_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.OnGlobalColorChange
	 */
	struct UUI_VitalsWidget_C_OnGlobalColorChange_Params
	{	};

	/**
	 * Function UI_VitalsWidget.UI_VitalsWidget_C.ExecuteUbergraph_UI_VitalsWidget
	 */
	struct UUI_VitalsWidget_C_ExecuteUbergraph_UI_VitalsWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
